# Atividade Final

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import sys
sys.path.append('../')

# Importação bibliateca de funções
from src.data_visulization.visualization import visuliza_duplicados, visuliza_dados_NaN
from src.data_cleaning.cleaning import drop_duplicados

#### Carregamento dos dados

In [2]:
df = pd.read_csv("../data/consumo_energia_eletrica.csv", sep=',')

In [3]:
df.head()
df.tail()

        ano  mes sigla_uf tipo_consumo  numero_consumidores  consumo
39892  2023   12       BA  Residencial            5932740.0   718461
39893  2023   12       PA  Residencial            2614106.0   478726
39894  2023   12       AC  Residencial             245699.0    58301
39895  2023   12       RN  Residencial            1390080.0   210119
39896  2023   12       SC  Residencial            2719791.0   655389

* Analisando a quantidade de registros e Atributos

In [4]:
df.shape

(39897, 6)

#### Analisando dados faltantes

* Analisando os tipos de dados, sé há dados faltantes?

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39897 entries, 0 to 39896
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ano                  39897 non-null  int64
 1   mes                  39897 non-null  int64
 2   sigla_uf             39897 non-null  object
 3   tipo_consumo         39897 non-null  object
 4   numero_consumidores  26937 non-null  float64
 5   consumo              39897 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 1.8+ MB

In [6]:
# Analisando a quantidade em percentual de dados faltantes

separacao = df.isna().sum()
final = (separacao / 39897) * 100
final

ano                     0.000000
mes                     0.000000
sigla_uf                0.000000
tipo_consumo            0.000000
numero_consumidores    32.483645
consumo                 0.000000
dtype: float64

##### Importação de modulos ou pacotes

In [7]:
visuliza_duplicados(df)

 Existem 1017 Dados duplicados

        ano  mes sigla_uf tipo_consumo  numero_consumidores  consumo
38880  2023   11       MS       Outros              99710.0   122350
38881  2023   11       RN       Outros              77359.0   112767
38882  2023   11       PE       Outros             157848.0   256509
38883  2023   11       ES       Outros             234985.0   180315
38884  2023   11       AC       Outros              23068.0    26323
...     ...  ...      ...          ...                  ...      ...
39892  2023   12       BA  Residencial            5932740.0   718461
39893  2023   12       PA  Residencial            2614106.0   478726
39894  2023   12       AC  Residencial             245699.0    58301
39895  2023   12       RN  Residencial            1390080.0   210119
39896  2023   12       SC  Residencial            2719791.0   655389

[1017 rows x 6 columns]

In [8]:
drop_duplicados(df)

        ano  mes sigla_uf tipo_consumo  numero_consumidores  consumo
0      2004    1       TO        Total                  NaN    65876
1      2004    1       BA        Total                  NaN  1444451
2      2004    1       PR        Total                  NaN  1596274
3      2004    1       RS        Total                  NaN  1780912
4      2004    1       GO        Total                  NaN   630624
...     ...  ...      ...          ...                  ...      ...
38875  2023   12       BA  Residencial            5932740.0   718461
38876  2023   12       PA  Residencial            2614106.0   478726
38877  2023   12       AC  Residencial             245699.0    58301
38878  2023   12       RN  Residencial            1390080.0   210119
38879  2023   12       SC  Residencial            2719791.0   655389

[38880 rows x 6 columns]

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 38880 entries, 0 to 38879
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ano                  38880 non-null  int64
 1   mes                  38880 non-null  int64
 2   sigla_uf             38880 non-null  object
 3   tipo_consumo         38880 non-null  object
 4   numero_consumidores  25920 non-null  float64
 5   consumo              38880 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 2.1+ MB

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 38880 entries, 0 to 38879
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ano                  38880 non-null  int64
 1   mes                  38880 non-null  int64
 2   sigla_uf             38880 non-null  object
 3   tipo_consumo         38880 non-null  object
 4   numero_consumidores  25920 non-null  float64
 5   consumo              38880 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 2.1+ MB

In [11]:
df.describe

<bound method NDFrame.describe of         ano  mes sigla_uf tipo_consumo  numero_consumidores  consumo
0      2004    1       TO        Total                  NaN    65876
1      2004    1       BA        Total                  NaN  1444451
2      2004    1       PR        Total                  NaN  1596274
3      2004    1       RS        Total                  NaN  1780912
4      2004    1       GO        Total                  NaN   630624
...     ...  ...      ...          ...                  ...      ...
38875  2023   12       BA  Residencial            5932740.0   718461
38876  2023   12       PA  Residencial            2614106.0   478726
38877  2023   12       AC  Residencial             245699.0    58301
38878  2023   12       RN  Residencial            1390080.0   210119
38879  2023   12       SC  Residencial            2719791.0   655389

[38880 rows x 6 columns]>

In [12]:
# dados faltantes
visuliza_dados_NaN(df)

         ano    mes  sigla_uf  tipo_consumo  numero_consumidores  consumo
0      False  False     False         False                 True    False
1      False  False     False         False                 True    False
2      False  False     False         False                 True    False
3      False  False     False         False                 True    False
4      False  False     False         False                 True    False
...      ...    ...       ...           ...                  ...      ...
38875  False  False     False         False                False    False
38876  False  False     False         False                False    False
38877  False  False     False         False                False    False
38878  False  False     False         False                False    False
38879  False  False     False         False                False    False

[38880 rows x 6 columns]